{"cells":[{"cell_type":"markdown","metadata":{"id":"zJcb9K1NUp7y"},"source":["# Importing Libraries\n","***"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"m5rlmhwSUp71"},"outputs":[],"source":["from neo4j import GraphDatabase\n","from pandas import DataFrame\n","import pandas as pd\n","import numpy as np\n","import re\n","import csv\n","import ast\n","import json"]},{"cell_type":"markdown","metadata":{"id":"tg_M8njxUp74"},"source":["# Connecting to Neo4j\n","***"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"zk9d31XUUp75"},"outputs":[],"source":["from neo4j import GraphDatabase\n","\n","driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"123123123\"))"]},{"cell_type":"markdown","metadata":{"id":"0Qyk_Cs6Up75"},"source":["# Deffining Useful Functions\n","***"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"pdHh3lwxUp76"},"outputs":[],"source":["def run_query(query): \n","     with driver.session() as session:\n","        result = session.run(query)\n","        #print(result.single()[0])\n","        \n","        \n","def delete_all_nodes():\n","    query = '''\n","    MATCH(n) DETACH DELETE(n)\n","    '''\n","    run_query(query)\n","\n","def record_count():\n","    with driver.session() as session:\n","        result = session.run(\"MATCH (n) RETURN count(n) LIMIT 100\")\n","        print(result.single())\n","\n","def delete_nodes(var):\n","    query = f'''\n","    MATCH (c:{var})\n","    DELETE c\n","\n","    '''\n","    run_query(query)"]},{"cell_type":"markdown","metadata":{"id":"h-kjZFGEUp76"},"source":["# Adding Organization (Affiliation) Data to Author Nodes\n","***"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"ncEpn_b4Up77"},"outputs":[],"source":["df_auth = pd.read_csv(\"./data/authors.csv\", encoding='utf-8')"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"dd_BX2EgUp77","outputId":"af56f877-4030-4e6c-9546-3b1c941dd8e4"},"outputs":[{"name":"stdout","output_type":"stream","text":["14734\n"]},{"data":{"text/plain":["(27765, 3)"]},"execution_count":35,"metadata":{},"output_type":"execute_result"}],"source":["print(len(df_auth['org'].unique()))\n","df_auth.shape"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"_xnCTVZgUp78"},"outputs":[],"source":["query = \"\"\"\n","    LOAD CSV WITH HEADERS FROM \"file:///C:/Users/odyky/Desktop/Property_Graph_Research_Publications/data/authors.csv\" AS x\n","    MATCH (a:Author {id: x.id})\n","    SET a.org = x.org\n","    \"\"\"\n","run_query(query=query)"]},{"cell_type":"markdown","metadata":{"id":"vRm9qrhiUp79"},"source":["# Reading Reviewers Data\n","***"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"1AUdp1i4Up79","outputId":"c76b5dd1-2be4-42f5-95d7-354114547007"},"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>PaperID</th>\n","      <th>ReviewerID</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>53e9b41bb7602d9703f14db9</td>\n","      <td>53f468dcdabfaeb22f54794f</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>53e9b41bb7602d9703f14db9</td>\n","      <td>53f39bdadabfae4b34a98b5e</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>53e9b41bb7602d9703f14db9</td>\n","      <td>53f42b9adabfaedd74d1b267</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>53e9b40eb7602d9703f04298</td>\n","      <td>53f784eedabfae92b40c203a</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>53e9b40eb7602d9703f04298</td>\n","      <td>562ca9cf45cedb3398c8b9f5</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                    PaperID                ReviewerID\n","0  53e9b41bb7602d9703f14db9  53f468dcdabfaeb22f54794f\n","1  53e9b41bb7602d9703f14db9  53f39bdadabfae4b34a98b5e\n","2  53e9b41bb7602d9703f14db9  53f42b9adabfaedd74d1b267\n","3  53e9b40eb7602d9703f04298  53f784eedabfae92b40c203a\n","4  53e9b40eb7602d9703f04298  562ca9cf45cedb3398c8b9f5"]},"execution_count":37,"metadata":{},"output_type":"execute_result"}],"source":["df = pd.read_csv(\"./data/papers_reviewers.csv\", encoding='utf-8')\n","df.head(5)"]},{"cell_type":"markdown","metadata":{"id":"GhsKoAUGUp7-"},"source":["## Generate Artificial Response Values"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"qmTA6vz1Up7-"},"outputs":[],"source":["x = int(len(df) / 3)  # number of times to repeat the pattern\n","result = [] # create an empty list to store the result\n","description = [] # create an empty list to store the result\n","\n","for i in range(x):\n","    result.append(\"yes\")\n","    result.append(\"yes\")\n","    result.append(\"no\")\n","    description.append(\"Excellent Work. It can be Published\")\n","    description.append(\"Excellent Work. It can be Published\")\n","    description.append(\"Have minor mistakes. Need modifications in the following parts:...\")\n","\n","df['response'] = result\n","df['description'] = description"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"TaTIbuE9Up7_","outputId":"1e6c3ba7-103e-4eb1-e441-a09f467d2527"},"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>PaperID</th>\n","      <th>ReviewerID</th>\n","      <th>response</th>\n","      <th>description</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>53e9b41bb7602d9703f14db9</td>\n","      <td>53f468dcdabfaeb22f54794f</td>\n","      <td>yes</td>\n","      <td>Excellent Work. It can be Published</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>53e9b41bb7602d9703f14db9</td>\n","      <td>53f39bdadabfae4b34a98b5e</td>\n","      <td>yes</td>\n","      <td>Excellent Work. It can be Published</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>53e9b41bb7602d9703f14db9</td>\n","      <td>53f42b9adabfaedd74d1b267</td>\n","      <td>no</td>\n","      <td>Have minor mistakes. Need modifications in the...</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>53e9b40eb7602d9703f04298</td>\n","      <td>53f784eedabfae92b40c203a</td>\n","      <td>yes</td>\n","      <td>Excellent Work. It can be Published</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>53e9b40eb7602d9703f04298</td>\n","      <td>562ca9cf45cedb3398c8b9f5</td>\n","      <td>yes</td>\n","      <td>Excellent Work. It can be Published</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                    PaperID                ReviewerID response  \\\n","0  53e9b41bb7602d9703f14db9  53f468dcdabfaeb22f54794f      yes   \n","1  53e9b41bb7602d9703f14db9  53f39bdadabfae4b34a98b5e      yes   \n","2  53e9b41bb7602d9703f14db9  53f42b9adabfaedd74d1b267       no   \n","3  53e9b40eb7602d9703f04298  53f784eedabfae92b40c203a      yes   \n","4  53e9b40eb7602d9703f04298  562ca9cf45cedb3398c8b9f5      yes   \n","\n","                                         description  \n","0                Excellent Work. It can be Published  \n","1                Excellent Work. It can be Published  \n","2  Have minor mistakes. Need modifications in the...  \n","3                Excellent Work. It can be Published  \n","4                Excellent Work. It can be Published  "]},"execution_count":39,"metadata":{},"output_type":"execute_result"}],"source":["df.head()"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"6IhWgYuIUp7_"},"outputs":[],"source":["df.to_csv(\"./data/papers_reviewers.csv\", encoding='utf-8', index=False)"]},{"cell_type":"markdown","metadata":{"id":"SUeLY6S3Up8A"},"source":["# Adding Response and Description Data to Reviews Relationship\n","***"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"YcFG975ZUp8A"},"outputs":[],"source":["query = \"\"\"\n","    LOAD CSV WITH HEADERS FROM \"file:///C:/Users/odyky/Desktop/Property_Graph_Research_Publications/data/papers_reviewers.csv\" AS x\n","    MATCH (a:Author {id: x.ReviewerID}) - [r:reviews] -> (c:Paper {id: x.PaperID})\n","    SET r.decision = x.response\n","    SET r.description = x.description\n","    \"\"\"\n","run_query(query=query)"]}],"metadata":{"kernelspec":{"display_name":"venv","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.7"},"orig_nbformat":4,"colab":{"provenance":[]}},"nbformat":4,"nbformat_minor":0}