{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Importing Libraries\n",
    "***"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from pandas import DataFrame\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import re\n",
    "import csv\n",
    "import ast\n",
    "import json"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Connecting to Neo4j\n",
    "***"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"123123123\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Deffining Useful Functions\n",
    "***"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_query(query): \n",
    "     with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        #print(result.single()[0])\n",
    "        \n",
    "        \n",
    "def delete_all_nodes():\n",
    "    query = '''\n",
    "    MATCH(n) DETACH DELETE(n)\n",
    "    '''\n",
    "    run_query(query)\n",
    "\n",
    "def record_count():\n",
    "    with driver.session() as session:\n",
    "        result = session.run(\"MATCH (n) RETURN count(n) LIMIT 100\")\n",
    "        print(result.single())\n",
    "\n",
    "def delete_nodes(var):\n",
    "    query = f'''\n",
    "    MATCH (c:{var})\n",
    "    DELETE c\n",
    "\n",
    "    '''\n",
    "    run_query(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Recommender\n",
    "## Find/Define Research Communities\n",
    "***\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['big data', 'indexing', 'data management', 'data storage', 'data']\n"
     ]
    }
   ],
   "source": [
    "def get_community_keywords(query): \n",
    "     with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        keywords= []\n",
    "        for record in result:\n",
    "            keyword = record['n.name']\n",
    "            keywords.append(keyword)\n",
    "        return keywords\n",
    "\n",
    "query = '''MATCH (n:Keyword) \n",
    "WHERE n.name IN ['data modeling', 'big data', 'data', 'data storage', 'processing', 'data querying', 'data management', 'indexing']\n",
    "RETURN n.name\n",
    "'''\n",
    "\n",
    "result = get_community_keywords(query)\n",
    "#result.head(10)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = '''\n",
    "MERGE (c: Community {name: 'database'})\n",
    "'''\n",
    "run_query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "for elem in result:\n",
    "    with driver.session() as session:\n",
    "        result = session.run(\n",
    "        '''MATCH (c:Community{name:'database'}), (k:Keyword {name:$keyword}) MERGE (c)-[:has_keyword]->(k)''', keyword = elem)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Conferences and journals related to the database community\n",
    "### A conference or a journal is related to the database community if 90% of the papers published in a conference/journal contain one of the keywords of the database\n",
    "***"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[(0, 119334), (0, 119714), (0, 118848), (0, 119048), (0, 119392), (0, 119758)]\n",
      "[(0, 120970), (0, 120326)]\n"
     ]
    }
   ],
   "source": [
    "def get_related_conferences(query): \n",
    "     with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        commun_conf_dict = []\n",
    "        for record in result:\n",
    "            com_id = record['ID(c)']\n",
    "            conf_id = record['ID(conf)']\n",
    "            commun_conf_dict.append((com_id,conf_id))\n",
    "        return commun_conf_dict\n",
    "\n",
    "def get_related_journals(query): \n",
    "     with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        journal_conf_dict = []\n",
    "        for record in result:\n",
    "            com_id = record['ID(c)']\n",
    "            journ_id = record['ID(j)']\n",
    "            journal_conf_dict.append((com_id,journ_id))\n",
    "        return journal_conf_dict\n",
    "\n",
    "query_conf = '''\n",
    "MATCH (c:Community)-[:has_keyword]->(k:Keyword)\n",
    "WHERE c.name = 'database'\n",
    "WITH c, k\n",
    "MATCH (p:Paper)-[:published_in_conference]->(conf:Conference)\n",
    "WHERE (p)-[:has_keyword]->(k)\n",
    "WITH c, conf, k, count(DISTINCT p) as num_papers\n",
    "WHERE num_papers / toFloat(size((conf)<-[:published_in_conference]-())) >= 0.9\n",
    "RETURN ID(c), ID(conf)\n",
    "'''\n",
    "query_journal = '''\n",
    "MATCH (c:Community)-[:has_keyword]->(k:Keyword)\n",
    "WHERE c.name = 'database'\n",
    "WITH c, k\n",
    "MATCH (p2:Paper)-[:published_in_journal]->(j:Journal)\n",
    "WHERE (p2)-[:has_keyword]->(k)\n",
    "WITH c, j, k, count(DISTINCT p2) as num_journal_papers\n",
    "WHERE num_journal_papers / toFloat(size((j)<-[:published_in_journal]-())) >= 0.9\n",
    "RETURN ID(c), ID(j)\n",
    "'''\n",
    "confs = get_related_conferences(query_conf)\n",
    "journs = get_related_journals(query_journal)\n",
    "\n",
    "print(confs)\n",
    "print(journs)\n",
    "\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Extending the graph by adding relations between the communities and the related conferences/journals"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "for elem in confs:\n",
    "    with driver.session() as session:\n",
    "        result = session.run(\n",
    "        '''MATCH (n1), (n2)\n",
    "        WHERE ID(n1) = $id1 AND ID(n2) = $id2\n",
    "        MERGE (n1)-[:is_related_to]->(n2)''', id1 = elem[1], id2 =elem[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "for elem in journs:\n",
    "    with driver.session() as session:\n",
    "        result = session.run(\n",
    "        '''MATCH (n1), (n2)\n",
    "        WHERE ID(n1) = $id1 AND ID(n2) = $id2\n",
    "        MERGE (n1)-[:is_related_to]->(n2)''', id1 = elem[1], id2 =elem[0])"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Identifying the top papers of the related conferences/journals of database community"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create graph projection of database community papers and citations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_prev = '''CALL gds.graph.project.cypher('citedByDatabaseComm', 'MATCH (c:Community)\n",
    "WHERE c.name = \"database\"\n",
    "WITH c\n",
    "MATCH (c)<-[:is_related_to]-(j :Journal) <- [:published_in_journal] - (p1:Paper)\n",
    "WITH c,j,p1\n",
    "MATCH (c)<-[:is_related_to]-(conf :Conference) <- [:published_in_conference] - (p:Paper)\n",
    "WITH c,conf,j,p,p1\n",
    "WITH Collect(p1) + Collect(p) AS papers, c,j,conf\n",
    "UNWIND papers as p3\n",
    "MATCH a = (f:Paper)-[:cites]->(p3:Paper)\n",
    "WITH COLLECT(f)+COLLECT(p3) as nodes\n",
    "UNWIND nodes as nodes_item\n",
    "RETURN id(nodes_item) as id', 'MATCH (c:Community)\n",
    "WHERE c.name = \"database\"\n",
    "WITH c\n",
    "MATCH (c)<-[:is_related_to]-(j :Journal) <- [:published_in_journal] - (p1:Paper)\n",
    "WITH c,j,p1\n",
    "MATCH (c)<-[:is_related_to]-(conf :Conference) <- [:published_in_conference] - (p:Paper)\n",
    "WITH c,conf,j,p,p1\n",
    "WITH Collect(p1) + Collect(p) AS papers, c,j,conf\n",
    "UNWIND papers as p3\n",
    "MATCH a = (f:Paper)-[:cites]->(p3:Paper)\n",
    "RETURN id(f) as source, id(p3) as target, \"cites\" as type')'''\n",
    "\n",
    "run_query(query_prev)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Setting up the queries for PageRank Algorithm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "query1 = '''MATCH (c:Community)\n",
    "WHERE c.name = \"database\"\n",
    "WITH c\n",
    "MATCH (c)<-[:is_related_to]-(j :Journal)\n",
    "WITH c,j\n",
    "MATCH (c)<-[:is_related_to]-(conf :Conference)\n",
    "WITH c,j,conf\n",
    "MATCH (p)-[:published_in_journal]->(j)\n",
    "WITH p,c,j,conf\n",
    "MATCH (p1)-[:published_in_conference]->(conf)\n",
    "WITH Collect(p1) + Collect(p) AS papers\n",
    "WITH apoc.convert.toList(papers) AS regularList\n",
    "\n",
    "CALL gds.pageRank.stream('citedByDatabaseComm')\n",
    "YIELD nodeId, score\n",
    "RETURN nodeId AS id_paper, score\n",
    "ORDER BY score DESC, id_paper ASC\n",
    "'''\n",
    "\n",
    "query2 = '''MATCH (c:Community)\n",
    "WHERE c.name = \"database\"\n",
    "WITH c\n",
    "MATCH (c)<-[:is_related_to]-(j :Journal)\n",
    "WITH c,j\n",
    "MATCH (c)<-[:is_related_to]-(conf :Conference)\n",
    "WITH c,j,conf\n",
    "MATCH (p)-[:published_in_journal]->(j)\n",
    "WITH p,c,j,conf\n",
    "MATCH (p1)-[:published_in_conference]->(conf)\n",
    "WITH Collect(p1) + Collect(p) AS papers\n",
    "UNWIND papers as lista\n",
    "RETURN DISTINCT id(lista) as ids_comm\n",
    "'''"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Setting up the queries for PageRank Algorithm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Paper_ID</th>\n",
       "      <th>page_rank_score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>23622</td>\n",
       "      <td>2.1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>17232</td>\n",
       "      <td>1.4250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>20411</td>\n",
       "      <td>1.4250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>18459</td>\n",
       "      <td>1.2975</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>18627</td>\n",
       "      <td>1.2975</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>15819</td>\n",
       "      <td>0.9150</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>16219</td>\n",
       "      <td>0.9150</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>17028</td>\n",
       "      <td>0.6600</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Paper_ID  page_rank_score\n",
       "0     23622           2.1900\n",
       "1     17232           1.4250\n",
       "2     20411           1.4250\n",
       "3     18459           1.2975\n",
       "4     18627           1.2975\n",
       "5     15819           0.9150\n",
       "6     16219           0.9150\n",
       "7     17028           0.6600"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def page_rank(query): \n",
    "     with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        records = []\n",
    "        for record in result:\n",
    "            id_paper = record['id_paper']\n",
    "            score = record['score']\n",
    "            records.append({'Paper_ID': id_paper, 'page_rank_score': score})\n",
    "\n",
    "        df = pd.DataFrame.from_records(records)\n",
    "        return df\n",
    "    \n",
    "def dataset_community_papers(query): \n",
    "     with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        records = []\n",
    "        for record in result:\n",
    "            ids_comm = record['ids_comm']\n",
    "            records.append({'ids_comm': ids_comm})\n",
    "\n",
    "        df = pd.DataFrame.from_records(records)\n",
    "        return df\n",
    "\n",
    "df_pagerank = page_rank(query1)\n",
    "df_community_database = dataset_community_papers(query2)\n",
    "\n",
    "id_list = list(df_community_database['ids_comm'])\n",
    "filtered_page_ranks = df_pagerank[df_pagerank['Paper_ID'].isin(id_list)]\n",
    "filtered_page_ranks"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Extending the graph by adding a relationship between the 100 top papers of a community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in list(filtered_page_ranks[:100]['Paper_ID']):\n",
    "    with driver.session() as session:\n",
    "        result = session.run('''MATCH (c:Community), (p:Paper)\n",
    "        WHERE c.name = 'database' AND ID(p) = $id_paper\n",
    "        MERGE (p)-[:is_top_100]->(c)''', id_paper = i)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Identifying potential reviewers of the community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author_id</th>\n",
       "      <th>author_name</th>\n",
       "      <th>community_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>53f43600dabfaedce552bb22</td>\n",
       "      <td>Michael Stonebraker</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>53f430b0dabfaeb1a7bb524d</td>\n",
       "      <td>Richard R. Berman</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>540544efdabfae8faa5bb0ee</td>\n",
       "      <td>Stéphane Marchand-Maillet</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>53f78543dabfae92b40c2294</td>\n",
       "      <td>Hisham Mohamed</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>53f4d1dfdabfaef0f0f8093d</td>\n",
       "      <td>Yin Liao</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5429fcc8dabfae5848a84a62</td>\n",
       "      <td>Guoliang Chen</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>56cb18b4c35f4f3c6565c9b8</td>\n",
       "      <td>Yunquan Zhang</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>53f49d2cdabfaee1c0baddc7</td>\n",
       "      <td>Tao Luo</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>53f59ae6dabfaeec23f8045b</td>\n",
       "      <td>Joel H Saltz</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>53fa0780dabfae7f97b00f3e</td>\n",
       "      <td>Fusheng Wang</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>53f42e96dabfaee2a1c8bebc</td>\n",
       "      <td>Ablimit Aji</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>53f42a94dabfaeb22f3da0a5</td>\n",
       "      <td>Masatoshi Okutomi</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>53f42ca0dabfaec09f109a5d</td>\n",
       "      <td>Tomas Pajdla</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>53f4dfdfdabfaefae777b4d1</td>\n",
       "      <td>Josef Sivic</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>53f44b39dabfaeecd69c0293</td>\n",
       "      <td>Akihiko Torii</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>53f454d5dabfaedf43605b81</td>\n",
       "      <td>Jacques Savoy</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>53f43600dabfaedce552bb22</td>\n",
       "      <td>Michael Stonebraker</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>53f3b2cfdabfae4b34b26302</td>\n",
       "      <td>Roman Kern</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>54874cbfdabfae9b401344f5</td>\n",
       "      <td>Stefanie N. Lindstaedt</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>53f45d74dabfaedce55c963c</td>\n",
       "      <td>Kai Schlegel</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>54855c0adabfae9b40133604</td>\n",
       "      <td>Christin Seifert</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>53f471a8dabfaec09f26b498</td>\n",
       "      <td>Belgin Mutlu</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>53f46eb6dabfaedd74e8abad</td>\n",
       "      <td>Stefan Zwicklbauer</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>53f43413dabfaedce5518704</td>\n",
       "      <td>Vedran Sabol</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>53f4395ddabfaee0d9b80e84</td>\n",
       "      <td>Sebastian Bayerl</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>54055dfadabfae91d3fda30c</td>\n",
       "      <td>Harald Kosch</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>5447fce2dabfae87b7dbc507</td>\n",
       "      <td>Michael Granitzer</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>53f42c67dabfaeb22f3f9a37</td>\n",
       "      <td>Patrick Höfler</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>53f46cc7dabfaedd74e835ce</td>\n",
       "      <td>Florian Stegmaier</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>53f434abdabfaedd74d90903</td>\n",
       "      <td>Chuanbo Chen</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>53f4607cdabfaeb22f525337</td>\n",
       "      <td>Mudar Sarem</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>53f4659adabfaeecd6a09f33</td>\n",
       "      <td>Yunping Zheng</td>\n",
       "      <td>database</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   author_id                author_name community_name\n",
       "0   53f43600dabfaedce552bb22        Michael Stonebraker       database\n",
       "1   53f430b0dabfaeb1a7bb524d          Richard R. Berman       database\n",
       "2   540544efdabfae8faa5bb0ee  Stéphane Marchand-Maillet       database\n",
       "3   53f78543dabfae92b40c2294             Hisham Mohamed       database\n",
       "4   53f4d1dfdabfaef0f0f8093d                   Yin Liao       database\n",
       "5   5429fcc8dabfae5848a84a62              Guoliang Chen       database\n",
       "6   56cb18b4c35f4f3c6565c9b8              Yunquan Zhang       database\n",
       "7   53f49d2cdabfaee1c0baddc7                    Tao Luo       database\n",
       "8   53f59ae6dabfaeec23f8045b               Joel H Saltz       database\n",
       "9   53fa0780dabfae7f97b00f3e               Fusheng Wang       database\n",
       "10  53f42e96dabfaee2a1c8bebc                Ablimit Aji       database\n",
       "11  53f42a94dabfaeb22f3da0a5          Masatoshi Okutomi       database\n",
       "12  53f42ca0dabfaec09f109a5d               Tomas Pajdla       database\n",
       "13  53f4dfdfdabfaefae777b4d1                Josef Sivic       database\n",
       "14  53f44b39dabfaeecd69c0293              Akihiko Torii       database\n",
       "15  53f454d5dabfaedf43605b81              Jacques Savoy       database\n",
       "16  53f43600dabfaedce552bb22        Michael Stonebraker       database\n",
       "17  53f3b2cfdabfae4b34b26302                 Roman Kern       database\n",
       "18  54874cbfdabfae9b401344f5     Stefanie N. Lindstaedt       database\n",
       "19  53f45d74dabfaedce55c963c               Kai Schlegel       database\n",
       "20  54855c0adabfae9b40133604           Christin Seifert       database\n",
       "21  53f471a8dabfaec09f26b498               Belgin Mutlu       database\n",
       "22  53f46eb6dabfaedd74e8abad         Stefan Zwicklbauer       database\n",
       "23  53f43413dabfaedce5518704               Vedran Sabol       database\n",
       "24  53f4395ddabfaee0d9b80e84           Sebastian Bayerl       database\n",
       "25  54055dfadabfae91d3fda30c               Harald Kosch       database\n",
       "26  5447fce2dabfae87b7dbc507          Michael Granitzer       database\n",
       "27  53f42c67dabfaeb22f3f9a37             Patrick Höfler       database\n",
       "28  53f46cc7dabfaedd74e835ce          Florian Stegmaier       database\n",
       "29  53f434abdabfaedd74d90903               Chuanbo Chen       database\n",
       "30  53f4607cdabfaeb22f525337                Mudar Sarem       database\n",
       "31  53f4659adabfaeecd6a09f33              Yunping Zheng       database"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# potential good match to review database papers\n",
    "def good_match_reviewer(query): \n",
    "     with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        records = []\n",
    "        for record in result:\n",
    "            id_author = record['a.id']\n",
    "            author_name = record['a.name']\n",
    "            com_name = record['c.name']\n",
    "            records.append({'author_id': id_author, 'author_name': author_name, 'community_name': com_name})\n",
    "\n",
    "        df = pd.DataFrame.from_records(records)\n",
    "        return df\n",
    "\n",
    "\n",
    "\n",
    "query_pot_reviewers = '''\n",
    "MATCH (a:Author) -[:wrote]->(p:Paper)-[:is_top_100]->(c:Community) RETURN a.id, a.name ,c.name\n",
    "'''\n",
    "x = good_match_reviewer(query_pot_reviewers)\n",
    "x"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Identifying gurus - authors of, at least, two papers among the top-100 identified"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author_id</th>\n",
       "      <th>community_id</th>\n",
       "      <th>out_of_100</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>31091</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  author_id community_id  out_of_100\n",
       "0     31091            0           2"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# potential good match to review database papers\n",
    "def get_gurus(query): \n",
    "     with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        records = []\n",
    "        for record in result:\n",
    "            id_author = record['a'].element_id\n",
    "            id_com = record['c'].element_id\n",
    "            number_of_papers_out_of_top_100 = record['num_top_100_papers']\n",
    "            records.append({'author_id': id_author, 'community_id': id_com, 'out_of_100': number_of_papers_out_of_top_100})\n",
    "\n",
    "        df = pd.DataFrame.from_records(records)\n",
    "        return df\n",
    "\n",
    "query_gurus = '''MATCH (a:Author)-[r:wrote]->(p:Paper)-[:is_top_100]->(c:Community)\n",
    "WITH a, c, count(p) as num_top_100_papers\n",
    "WHERE num_top_100_papers >= 2\n",
    "RETURN a,c, num_top_100_papers\n",
    "'''\n",
    "\n",
    "gurus = get_gurus(query_gurus)\n",
    "gurus"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Extending the graph by adding a relationship between Gurus and the specific Community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i,row in gurus.iterrows():\n",
    "    with driver.session() as session:\n",
    "        result = session.run('''MATCH (a:Author), (c:Community)\n",
    "                            WHERE ID(a) = $id_author AND ID(c) = $id_com\n",
    "                            MERGE (a)-[:is_guru_for]->(c)''', id_author = int(row['author_id']), id_com = int(row['community_id']))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.7"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
